#+title: Pets ontology, a minimal ELOT example
#+subtitle: An OWL ontology
#+author: John Doe
#+date: WIP

This file is for testing SPARQL query execution with ELOT.

*** Block 1: bare SELECT, no PREFIX boilerplate
#+begin_src sparql :url "my-ont.omn" :eval never-export :exports both
  select *
  {
    ?OP a owl:ObjectProperty .
    optional { ?OP rdfs:domain ?domain }
    optional { ?OP rdfs:range ?range }
  } 
#+end_src

#+RESULTS:
| OP        | domain | range  |
|-----------+--------+--------|
| ex:chases | ex:dog | ex:cat |

*** Block 2: SELECT with one inline ~PREFIX~ that agrees with the ~prefix-table~
This will test deduplication.
#+begin_src sparql :url "my-ont.omn" :eval never-export :exports both
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>  # already defined

  select *
  {
    ?OP a owl:ObjectProperty .
    optional { ?OP rdfs:domain ?domain }
    optional { ?OP rdfs:range ?range }
  } 
#+end_src

#+RESULTS:
| OP        | domain | range  |
|-----------+--------+--------|
| ex:chases | ex:dog | ex:cat |

*** Block 3: SELECT with one inline ~PREFIX~ that overrides the alist by redeclaration
We declare ~rdfs:~ with a different URI, so the query doesn't return any result for domain/range.

#+begin_src sparql :url "my-ont.omn" :eval never-export :exports both
  PREFIX rdfs: <http://example.com/>    # existing prefix, different uri

  select *
  {
    ?OP a owl:ObjectProperty .
    optional { ?OP rdfs:domain ?domain }
    optional { ?OP rdfs:range ?range }
  } 
#+end_src

#+RESULTS:
| OP        | domain | range |
|-----------+--------+-------|
| ex:chases |        |       |

*** Block 4: SELECT with one inline ~PREFIX~ that introduces a new prefix to replace an existing one
We declare ~foo:~ with an existing URI, and want to see that replacing ~ex:~ in the output.

#+begin_src sparql :url "my-ont.omn" :eval never-export :exports both
  PREFIX foo: <http://example.org/>    # existing prefix, different uri

  select *
  {
    ?OP a owl:ObjectProperty .
    optional { ?OP rdfs:domain ?domain }
    optional { ?OP rdfs:range ?range }
  } 
#+end_src

#+RESULTS:
| OP        | domain | range  |
|-----------+--------+--------|
| ex:chases | ex:dog | ex:cat |


*** Block 6: SELECT with empty result
#+begin_src sparql :url "my-ont.omn" :eval never-export :exports both
  select *
  {
    ?OP a owl:DatatypeProperty .
  } 
#+end_src

#+RESULTS:
: [empty result set]


